{
  "format": "layers-model",
  "generatedBy": "keras v2.8.0",
  "convertedBy": "TensorFlow.js Converter v3.18.0",
  "modelTopology": {
    "keras_version": "2.8.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Functional",
      "config": {
        "name": "model_1",
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [null, 48, 48, 3],
              "dtype": "float32",
              "sparse": false,
              "ragged": false,
              "name": "input_2"
            },
            "name": "input_2",
            "inbound_nodes": []
          },
          {
            "class_name": "Permute",
            "config": {
              "name": "permute",
              "trainable": true,
              "dtype": "float32",
              "dims": [2, 1, 3]
            },
            "name": "permute",
            "inbound_nodes": [[["input_2", 0, 0, {}]]]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv1",
              "trainable": true,
              "dtype": "float32",
              "filters": 32,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "valid",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "groups": 1,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "conv1",
            "inbound_nodes": [[["permute", 0, 0, {}]]]
          },
          {
            "class_name": "PReLU",
            "config": {
              "name": "prelu1",
              "trainable": true,
              "dtype": "float32",
              "alpha_initializer": { "class_name": "Zeros", "config": {} },
              "alpha_regularizer": null,
              "alpha_constraint": null,
              "shared_axes": [1, 2]
            },
            "name": "prelu1",
            "inbound_nodes": [[["conv1", 0, 0, {}]]]
          },
          {
            "class_name": "MaxPooling2D",
            "config": {
              "name": "pool1",
              "trainable": true,
              "dtype": "float32",
              "pool_size": [3, 3],
              "padding": "same",
              "strides": [2, 2],
              "data_format": "channels_last"
            },
            "name": "pool1",
            "inbound_nodes": [[["prelu1", 0, 0, {}]]]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv2",
              "trainable": true,
              "dtype": "float32",
              "filters": 64,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "valid",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "groups": 1,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "conv2",
            "inbound_nodes": [[["pool1", 0, 0, {}]]]
          },
          {
            "class_name": "PReLU",
            "config": {
              "name": "prelu2",
              "trainable": true,
              "dtype": "float32",
              "alpha_initializer": { "class_name": "Zeros", "config": {} },
              "alpha_regularizer": null,
              "alpha_constraint": null,
              "shared_axes": [1, 2]
            },
            "name": "prelu2",
            "inbound_nodes": [[["conv2", 0, 0, {}]]]
          },
          {
            "class_name": "MaxPooling2D",
            "config": {
              "name": "pool2",
              "trainable": true,
              "dtype": "float32",
              "pool_size": [3, 3],
              "padding": "valid",
              "strides": [2, 2],
              "data_format": "channels_last"
            },
            "name": "pool2",
            "inbound_nodes": [[["prelu2", 0, 0, {}]]]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv3",
              "trainable": true,
              "dtype": "float32",
              "filters": 64,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "valid",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "groups": 1,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "conv3",
            "inbound_nodes": [[["pool2", 0, 0, {}]]]
          },
          {
            "class_name": "PReLU",
            "config": {
              "name": "prelu3",
              "trainable": true,
              "dtype": "float32",
              "alpha_initializer": { "class_name": "Zeros", "config": {} },
              "alpha_regularizer": null,
              "alpha_constraint": null,
              "shared_axes": [1, 2]
            },
            "name": "prelu3",
            "inbound_nodes": [[["conv3", 0, 0, {}]]]
          },
          {
            "class_name": "MaxPooling2D",
            "config": {
              "name": "pool3",
              "trainable": true,
              "dtype": "float32",
              "pool_size": [2, 2],
              "padding": "same",
              "strides": [2, 2],
              "data_format": "channels_last"
            },
            "name": "pool3",
            "inbound_nodes": [[["prelu3", 0, 0, {}]]]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv4",
              "trainable": true,
              "dtype": "float32",
              "filters": 128,
              "kernel_size": [2, 2],
              "strides": [1, 1],
              "padding": "valid",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "groups": 1,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "conv4",
            "inbound_nodes": [[["pool3", 0, 0, {}]]]
          },
          {
            "class_name": "PReLU",
            "config": {
              "name": "prelu4",
              "trainable": true,
              "dtype": "float32",
              "alpha_initializer": { "class_name": "Zeros", "config": {} },
              "alpha_regularizer": null,
              "alpha_constraint": null,
              "shared_axes": [1, 2]
            },
            "name": "prelu4",
            "inbound_nodes": [[["conv4", 0, 0, {}]]]
          },
          {
            "class_name": "Flatten",
            "config": {
              "name": "flatten",
              "trainable": true,
              "dtype": "float32",
              "data_format": "channels_last"
            },
            "name": "flatten",
            "inbound_nodes": [[["prelu4", 0, 0, {}]]]
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense5",
              "trainable": true,
              "dtype": "float32",
              "units": 256,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "dense5",
            "inbound_nodes": [[["flatten", 0, 0, {}]]]
          },
          {
            "class_name": "PReLU",
            "config": {
              "name": "prelu5",
              "trainable": true,
              "dtype": "float32",
              "alpha_initializer": { "class_name": "Zeros", "config": {} },
              "alpha_regularizer": null,
              "alpha_constraint": null,
              "shared_axes": null
            },
            "name": "prelu5",
            "inbound_nodes": [[["dense5", 0, 0, {}]]]
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense6_1",
              "trainable": true,
              "dtype": "float32",
              "units": 2,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "dense6_1",
            "inbound_nodes": [[["prelu5", 0, 0, {}]]]
          },
          {
            "class_name": "Softmax",
            "config": {
              "name": "softmax_1",
              "trainable": true,
              "dtype": "float32",
              "axis": -1
            },
            "name": "softmax_1",
            "inbound_nodes": [[["dense6_1", 0, 0, {}]]]
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense6_2",
              "trainable": true,
              "dtype": "float32",
              "units": 4,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "dense6_2",
            "inbound_nodes": [[["prelu5", 0, 0, {}]]]
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense6_3",
              "trainable": true,
              "dtype": "float32",
              "units": 10,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "dense6_3",
            "inbound_nodes": [[["prelu5", 0, 0, {}]]]
          }
        ],
        "input_layers": [["input_2", 0, 0]],
        "output_layers": [
          ["softmax_1", 0, 0],
          ["dense6_2", 0, 0],
          ["dense6_3", 0, 0]
        ]
      }
    }
  },
  "weightsManifest": [
    {
      "paths": ["group1-shard1of1.bin"],
      "weights": [
        { "name": "conv1/kernel", "shape": [3, 3, 3, 32], "dtype": "float32" },
        { "name": "conv1/bias", "shape": [32], "dtype": "float32" },
        { "name": "conv2/kernel", "shape": [3, 3, 32, 64], "dtype": "float32" },
        { "name": "conv2/bias", "shape": [64], "dtype": "float32" },
        { "name": "conv3/kernel", "shape": [3, 3, 64, 64], "dtype": "float32" },
        { "name": "conv3/bias", "shape": [64], "dtype": "float32" },
        {
          "name": "conv4/kernel",
          "shape": [2, 2, 64, 128],
          "dtype": "float32"
        },
        { "name": "conv4/bias", "shape": [128], "dtype": "float32" },
        { "name": "dense5/kernel", "shape": [1152, 256], "dtype": "float32" },
        { "name": "dense5/bias", "shape": [256], "dtype": "float32" },
        { "name": "dense6_1/kernel", "shape": [256, 2], "dtype": "float32" },
        { "name": "dense6_1/bias", "shape": [2], "dtype": "float32" },
        { "name": "dense6_2/kernel", "shape": [256, 4], "dtype": "float32" },
        { "name": "dense6_2/bias", "shape": [4], "dtype": "float32" },
        { "name": "dense6_3/kernel", "shape": [256, 10], "dtype": "float32" },
        { "name": "dense6_3/bias", "shape": [10], "dtype": "float32" },
        { "name": "prelu1/alpha", "shape": [1, 1, 32], "dtype": "float32" },
        { "name": "prelu2/alpha", "shape": [1, 1, 64], "dtype": "float32" },
        { "name": "prelu3/alpha", "shape": [1, 1, 64], "dtype": "float32" },
        { "name": "prelu4/alpha", "shape": [1, 1, 128], "dtype": "float32" },
        { "name": "prelu5/alpha", "shape": [256], "dtype": "float32" }
      ]
    }
  ]
}
